#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйОбъект() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Тип", "ЗаписьЖурналаРегистрации");
	Результат.Вставить("ИмяСобытия", "");
	Результат.Вставить("Уровень", УровеньЖурналаРегистрации.Информация);
	Результат.Вставить("ОбъектМетаданных", Неопределено);
	Результат.Вставить("Данные", Неопределено);
	Результат.Вставить("Комментарий", "");
	Результат.Вставить("РежимТранзакции", РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
	
	Результат.Вставить("ЗаписыватьВСистемныйЖурнал", Ложь);
	Результат.Вставить("ВыводитьВОкноСообщений", Ложь);
	
	Результат.Вставить("Представление", "");
	
	Возврат Результат;
	
КонецФункции

Функция Создать(ИмяСобытия = "", Уровень = Неопределено, 
	ОбъектМетаданных = Неопределено, Данные = Неопределено, Комментарий = "", РежимТранзакции = Неопределено) Экспорт
	
	Результат = гр_ЗаписьЖурналаРегистрации.Объект();
	Результат.ИмяСобытия = ИмяСобытия;
	Результат.Уровень = Уровень;
	Результат.ОбъектМетаданных = ОбъектМетаданных;
	Результат.Данные = Данные;
	Результат.Комментарий = Комментарий;
	Результат.РежимТранзакции = РежимТранзакции;
	
	Заполнить(Результат);
	
	Возврат Результат;
	
КонецФункции

Процедура Заполнить(ДанныеОбъекта) Экспорт
	
	ДанныеОбъекта.Представление = СтрШаблон("ИмяСобытия = [%1], Комментарий = [%2]", 
		ДанныеОбъекта.ИмяСобытия, ДанныеОбъекта.Комментарий);
	
КонецПроцедуры

#КонецОбласти