#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КонтрольСоставногоПараметра(Параметр, Знач ИмяТипа, КонтекстПроверки = "") Экспорт
	
	Перем ИмяТипаПараметра;
	
	ОбщегоНазначенияКлиентСервер.Проверить((Параметр <> Неопределено), 
		"Значение параметра составного типа не может быть Неопределено.", КонтекстПроверки);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ИмяТипа), 
		"Не указано имя типа составного параметра.", КонтекстПроверки);
	
	ОбщегоНазначенияКлиентСервер.Проверить((ТипЗнч(Параметр) = Тип("Структура")), 
		"Неверный тип значения составного параметра.", КонтекстПроверки);
	
	Параметр.Свойство("Тип", ИмяТипаПараметра);
	
	ОбщегоНазначенияКлиентСервер.Проверить((ИмяТипаПараметра <> Неопределено), 
		"В структуре параметра составного типа не указано поле описания типа.", КонтекстПроверки);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ИмяТипаПараметра), 
		"В структуре параметра составного типа не указано описание типа.", КонтекстПроверки);
	
	ИмяТипаПараметра = ВРег(СокрЛП(ИмяТипаПараметра));
	ИмяТипа          = ВРег(СокрЛП(ИмяТипа));
	
	ОбщегоНазначенияКлиентСервер.Проверить(ИмяТипаПараметра = ИмяТипа, "Неверный тип параметра.", КонтекстПроверки);
	
КонецПроцедуры

#КонецОбласти