#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗапись(ДанныеЗаписи) Экспорт
	
	#Область Предусловия
	
	гр_ОбщегоНазначенияКлиентСервер.КонтрольСоставногоПараметра(ДанныеЗаписи, "ЗаписьЖурналаРегистрации");
	
	#КонецОбласти
	
	Если ДанныеЗаписи.ВыводитьВОкноСообщений Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеЗаписи.Представление);
	КонецЕсли;
	
	Если ДанныеЗаписи.ЗаписыватьВСистемныйЖурнал Тогда
		ЗаписьЖурналаРегистрации(ДанныеЗаписи.ИмяСобытия, ДанныеЗаписи.Уровень, ДанныеЗаписи.ОбъектМетаданных, 
			ДанныеЗаписи.Данные, ДанныеЗаписи.Комментарий, ДанныеЗаписи.РежимТранзакции);
	КонецЕсли;
	
	ЗаписьЖурнала = РегистрыСведений.гр_ЖурналРегистрации.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьЖурнала, ДанныеЗаписи);
	ЗаписьЖурнала.Идентификатор = Строка(Новый УникальныйИдентификатор());
	
	Попытка
		ЗаписьЖурнала.Записать();
	Исключение
		ИсключениеПриВыполнении = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение(ИсключениеПриВыполнении);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти