#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьВсеПакетыОбъектов() Экспорт
	
	#Область Контекст
	
	Если Ложь Тогда
		Пакет = Справочники.гр_ПакетыОбъектов.ПустаяСсылка();
	КонецЕсли;
	
	#КонецОбласти
	
	НачатьТранзакцию();
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.гр_СоставПакетаОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Записать(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	гр_ПакетыОбъектов.Ссылка КАК Пакет
		|ИЗ
		|	Справочник.гр_ПакетыОбъектов КАК гр_ПакетыОбъектов";
		
		Пакеты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пакет");
		
		Для каждого Пакет Из Пакеты Цикл
			ПакетОбъект = Пакет.ПолучитьОбъект();
			ПакетОбъект.Удалить();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ИсключениеПриВыполнении = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Запись = гр_ЗаписьЖурналаРегистрации.Создать("гр_МногопоточнаяОбработкаСервер.ОчиститьВсеПакетыОбъектов", 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ИсключениеПриВыполнении, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		
		гр_ЖурналРегистрацииСервер.ДобавитьЗапись(Запись);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти